/**
 * 5.1.1. Итератор для двухмерного массива int[][] [#9539]
 * Администратор,  08.10.17 9:44
 * Необходимо создать интератор для двухмерного массива.
 *
 * int[][] value = {
 * {1, 2}
 * {3, 4}
 * };
 *
 * метод next = должен вернуть последовательно 1, 2, 3, 4.
 * Старайтесь написать универсальное решение,
 * чтобы оно не было жестко ориентировано на тестовый пример.
 *
 *  DoubleArrayIterator Итератор двумерного массива int.
 *  DoubleArrayIntegerIterator Итератор двумерного массива Integer (могут присутствовать null значения).
 *
 */
package ru.job4j.iterator;