/**
 *
 * 1. На базе задания из занятия SRP расширить калькулятор [#851]
 *   Администратор,  14.06.16 5:42
 * На базе задания из занятия SRP расширить калькулятор. Сделать инженерный калькулятор.
 * Добавить вычисления например тригонометрии.
 *
 *--------- Предыдущее задпние --------
 *
 * 1. Использую класса Calculator. Сделать класс InteractCalc. [#850]
 *   Администратор,  27.01.17 13:33
 * Используя класс Calculator.
 * 1. Сделать класс InteractCalc.
 * 2. В классе должен быть пользовательский ввод.
 * 3. Повторный выбор операции и переиспользование предыдущего вычисления.
 * 4. Проект должен следовать SRP.
 *
 */
package ru.job4j.ood.calculator;