/**
 * Покрыть тестами реализованный код [#2096]
 *
 *--------- Предыдущее задпние --------
 *
 * Сделать java -jar запускаемым проект площадку машин. [#2095]
 *
 *--------- Предыдущее задпние --------
 *
 * Переделал Spring с XML на аннотации
 *
 *--------- Предыдущее задпние --------
 *
 * Добавить авторизацию и аутентификацию пользователей в площадку машин. [#2094]
 *
 *
 *
 *-------------------------------------
 *
 * Заменить использование SessionFactory на CrudRepository [#2093]
 *
 *
 *
 *-------------------------------------
 *
 * Реализовать площадку машин на spring mvc [#2092]
 *
 *
 *
 *-------------------------------------
 *
 * Переделал Hibernate с XML на аннотации
 *
 *--------- Предыдущее задпние --------
 *
 * Добавить интеграционные тесты для площадок машин. [#4746]
 *
 *
 *
 *--------- Предыдущее задпние --------
 *
 * Реализовать пользовательские фильтры для площадок машин [#4745]
 *
 *  Сделать в интерфейсе список с пунктами.
 * - показать за последний день
 * - показать с фото
 * - показать определенной марки.
 *
 *
 *
 *--------- Предыдущее задпние --------
 *
 * Реализовать площадку продаж машин. [#4747]
 *
 * Это должно быть web приложение со следующими страницами.
 * 1. основная страница. таблица со всеми объявлениям машин на продажу.
 * 2. на странице должна быть кнопка. добавить новое объявление.
 * 3. переходить на страницу добавления.
 * 4. должны быть категории машины. марка. тип кузова и тд. посмотри как на авито сделано.
 * 5. важно!. можно добавлять фото. использовать библиотеку apache fileuppload
 * 6. объявление имеет статус продано. или нет.
 * 7. должны существовать пользователи. кто подал заявление. только он может менять статус.Лямбды и шаблон wrapper. [#49295]
 *
 *
 *
 *--------- Предыдущее задпние --------
 *
 * Реализовать модели и связи для задание SQL хранилище машин. [#4744]
 *
 */
package ru.job4j.carpricesprboot;