/**
 *
 * Создать меню. [#4748]
 *   Петр Арсентьев,  26.11.16 18:14
 * Реализовать структуру для поддержания меню.
 * Каждый элемент меню имеет имя. Все меню должно выводиться на экран.
 * Каждый пункт меню может быть как одиночным элементов, так и иметь дочерние под пункты.
 * Все меню должно выводиться на экран. В виде дерева.
 * Предусмотреть возможность определяет действие, когда пользователь выбрать конкретный пункт меню.
 *
 * Например
 * Задача 1.
 * ---- Задача 1.1.
 * --------- Задача 1.1.1.
 * --------- Задача 1.1.2.
 * ----- Задача 1.2.
 *
 */
package ru.job4j.ood.menu;