/**
 * 2. Сетевой менеджер файлов. [#863]
 * Перед реализацией в коде. Составить каркас приложения на интерфейсах. С описанием.
 * 1. Разработать клиент серверное приложение на сокетах.
 * 2. Серверная часть должна реализовывать следующее апи
 *     - получить список корневого каталога. Корневой каталог задается при запуске сервера.
 *     - перейти в подкаталог.
 *     - спуститься в родительский каталог
 *     - скачать файл
 *     - загрузить файл.
 * 3. Клиент должен это апи уметь вызывать.
 * 4. настройки портов и адреса считывать с app.properties
 *
 *--------- Предыдущее задпние --------
 *
 * 1. Создать бот - мудрый Оракл.
 * 2. Серверная сторона.
 * Сервер должен отвечать на простые вопросы. Если Оралку сказали пока. То приложение выключается.
 * 3. Клиент.
 * 4. Важно. что Оракл может отправлять большие сообщения. Что бы понять когда конец сообщение он отправляет пустую строку.
 * 5. Обязательно напишите тесты https://www.youtube.com/watch?v=YEZx_Bz_OPA
 */
package ru.job4j.sockets;